# +++++++++++++++ かけ算定義 +++++++++++++++ #
Π(elements) = begin
  ret = 1
  for e ∈ elements
    ret = ret * e
  end
  ret
end
# +++++++++++++++ かけ算定義 +++++++++++++++ #

# +++++++++++++++ カテゴリカル分布 +++++++++++++++ #
Cat(S, P) = Π(P.^S)
# +++++++++++++++ カテゴリカル分布 +++++++++++++++ #

# +++++++++++++++ ガンマ関数 +++++++++++++++ #
Γ(x) = begin
    f(t) = t^(x-1)*exp(-t)
    quadgk(f, 0, Inf)[1]
end
# +++++++++++++++ ガンマ関数 +++++++++++++++ #

# +++++++++++++++ ガンマ分布の係数 +++++++++++++++ #
CG(a,b) = b^a / Γ(a)

# ガンマ分布
Gam(λ, a, b) = CG(a,b) * λ^(a-1) * exp(-b*λ)
# +++++++++++++++ ガンマ分布の係数 +++++++++++++++ #

# +++++++++++++++ ディリクレ分布の係数 +++++++++++++++ #
CD(Α) = Γ(sum(Α)) / sum([Γ(α) for α ∈ Α])

# ディリクレ分布
Dir(P, Α) = CD(Α) * Π(P.^(Α.-1))
# +++++++++++++++ ディリクレ分布の係数 +++++++++++++++ #

# +++++++++++++++ ポアソン分布 +++++++++++++++ #
Poi(x, λ) = (λ^x / factorial(BigInt(x))) * exp(-λ)
# +++++++++++++++ ポアソン分布 +++++++++++++++ #
